[
  "templater-obsidian",
  "dataview",
  "metadata-menu",
  "calendar",
  "obsidian-another-quick-switcher",
  "obsidian-list-callouts",
  "obsidian-outliner",
  "obsidian-paste-image-rename",
  "obsidian-spaced-repetition",
  "obsidian-tag-replacer",
  "obsidian-tasks-plugin",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-zotero-desktop-connector",
  "supercharged-links-obsidian",
  "task-search",
  "obsidian-scroll-offset",
  "auto-note-mover",
  "longform",
  "context-command-hider",
  "obsidian-linter",
  "task-calendar",
  "periodic-notes",
  "obsidian-dynamic-highlights",
  "obsidian-footnotes",
  "editing-toolbar",
  "various-complements",
  "quickadd",
  "obsidian-frontmatter-sync",
  "automatic-table-of-contents",
  "obsidian-excalidraw-plugin",
  "copy-url-in-preview",
  "janitor",
  "obsidian-to-anki-plugin",
  "obsidian-zoom",
  "obsidian42-brat"
]