[
  "lazy-plugins",
  "templater-obsidian",
  "dataview",
  "metadata-menu",
  "calendar",
  "obsidian-another-quick-switcher",
  "obsidian-better-command-palette",
  "obsidian-frontmatter-sync",
  "obsidian-list-callouts",
  "obsidian-outliner",
  "obsidian-paste-image-rename",
  "obsidian-quiet-outline",
  "obsidian-spaced-repetition",
  "obsidian-style-settings",
  "obsidian-tag-replacer",
  "obsidian-tasks-plugin",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-zotero-desktop-connector",
  "supercharged-links-obsidian",
  "task-search",
  "better-search-views",
  "obsidian-scroll-offset",
  "auto-note-mover",
  "query-control",
  "longform",
  "context-command-hider",
  "obsidian-linter",
  "obsidian-hotkeys-for-specific-files",
  "task-calendar",
  "periodic-notes",
  "quickadd",
  "obsidian-meta-bind-plugin",
  "obsidian-better-internal-link-inserter",
  "obsidian-smarter-md-hotkeys",
  "note-aliases",
  "obsidian-dynamic-highlights",
  "obsidian-footnotes",
  "editing-toolbar",
  "various-complements"
]