---
tags:
  - status/done
  - source/video/recording
  - category/study
aliases:
  - задание 9 python
status: 🟩
rating:
scientificity:
category:
  - "[[study]]"
meta:
problem:
creator:
production:
url: https://youtu.be/2C8ZF8tfM1E?si=0dqV4UTUGJRsQLVQ
start: 2026-04-03T13:41:38+03:00
end:
created: 2026-04-03T13:41:38+03:00
updated: 2026-04-06T09:10:17+03:00
---

Определить количество строк таблицы:
- в строке есть 2 числа, каждое из которых повторяется дважды, остальные 3 числа различны
- среднее арифметическое всех повторяющихся чисел строки меньше среднего арифметического всех её чисел
В ответ запишите только число

Копируем все из xls в txt (ctrl+a ctrl+v)
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.slit()]
	p2 = [x for x in a if a.count(x) == 2]
	np = [x for x in a if a.count(x) == 1]
	if len(p2) == 4 and len(np) == 3:
		if sum(p2) / len(p2) < sum(a) / len(a):
			count+=1
print(count)
	
```
**ВАЖНО**: если компилятор говорит, что max() arg is an empty sequence, то нужно удалить последнюю пустую строку в файле.
