---
tags:
  - status/wip
  - source/video/recording
  - category/study
aliases: []
status: 🟦
rating:
scientificity:
category:
  - "[[study]]"
meta:
problem:
creator:
  - Информатик Родя
production:
url: https://www.youtube.com/live/b4LSteWSJto?si=t1CHZFmxJqNo-AOm
start: 2026-04-03T14:12:03+03:00
end:
created: 2026-04-03T14:12:03+03:00
updated: 2026-04-03T15:38:22+03:00
---

# Банк заданий

kompege.ru

# Выбор повторяющихся элементов

## Повторяющиеся 2 раза

```python
a = [15, 17, 20, 20, 17, 17, 15, 50]

p2 = [x for x in a if a.count(x) == 2]
print(p2)
##[15, 20, 20, 15]
```

## Повторяющиеся 3 раза

```python
a = [15, 17, 20, 20, 17, 17, 15, 50]

p3 = [x for x in a if a.count(x) == 3]
print(p3)
##[17, 17, 17]
```

## Не повторяющиеся

```python
a = [15, 17, 20, 20, 17, 17, 15, 50]

np = [x for x in a if a.count(x) == 1]
print(np)
##[50]
```

# Считать данные из файла и записать в массив

```python
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
```

# Задачи

Определите количество строк таблицы, для чисел которых выполнены оба условия:
- в строке есть два числа, которые повторяются дважды, остальные числа различны
- среднее арифметическое повторяющихся чисел меньше среднего арифметического всех чисел
В ответ запишите число
—
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	p2 = [x for x in a.count(x) == 2]
	np = [x for x in a.count(x) == 1]
	if len(p2) == 4 and len(np) == (len(a) - len(p2)):
		if sum(p2) / len(p2) < sum(a) / len(a):
			count += 1
print(count)
```

Откройте файл электронной таблицы, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:
- максимальное число строки меньше суммы трёх оставшихся чисел
- четыре числа строки можно разбить на две пары чисел с равными суммами
—
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	if max(a) < sum(a) - max(a):
		if ((a[0] + a[1] == (a[2] + a[3])) or ((a[0] + a[2] == (a[1] + a[3])) or ((a[0] + a[3] == (a[1] + a[2])):
			count+=1
print(count)
```

в строке 6 натуральных чисел. Определить количество строк, для чисел которых выполнены *оба* условия:
- в строке все числа различных
- количество четных чисел превышает количество нечетных
—
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	np = [x for x in a if a.count(x) == 1]
	if len(np) == len(a):
		a1 = [x for x in a if x % 2 != 0]
		a2 = [x for x in a if x % 2 == 0]
		if len(a2) > len(a1):
			count +=1
print(count)
```
- ✅ С использованием `set` - коллекция в python с неповторяющимися элементами(как в [[java set]]):
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	if len(set(a)) == len(a):
		a1 = [x for x in a if x % 2 != 0]
		a2 = [x for x in a if x % 2 == 0]
		if len(a2) > len(a1):
			count +=1
print(count)
```
- ℹ️ Упрощение: через количество нечетных найти количество четных:
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	if len(set(a)) == len(a):
		a1 = [x for x in a if x % 2 != 0]
		a2 = len(a) - len(a1)
		if a2 > len(a1):
			count +=1
print(count)
```

9 чисел. определить количество строк, в которых выполняются *оба* условия:
- в строке есть *одно* число, которое повторяется *4 раза*, есть другое число, которое повторяется *дважды*, остальные числа *различны*;
- среднее арифметическое повторяющихся чисел строки *не меньше* *наибольшего* из повторяющихся в строке чисел
—
решение "в лоб", тупое:
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	p4 = [x for x in a if a.count(x) == 4]
	p2 = [x for x in a if a.count(x) == 2]
	np = [x for x in a if a.count(x) == 1]
	if len(p4) == 4 and len(p2) == 2 and len(np) == 3:
		if sum(np) / len(np) >= max([x for x in a if a.count(x) > 1]):
			count+=1
print(count)
```
- ✅ наибольшее повторяющееся число через сумму уже найденных повторяющихся:
```python
count = 0
for line in open('9.txt'):
	a = [int(x) for x in line.split()]
	p4 = [x for x in a if a.count(x) == 4]
	p2 = [x for x in a if a.count(x) == 2]
	np = [x for x in a if a.count(x) == 1]
	if len(p4) == 4 and len(p2) == 2 and len(np) == 3:
		if sum(np) / len(np) >= max(p4 + p2):
			count+=1
print(count)
```
