[
  "automatic-table-of-contents",
  "better-fn",
  "breadcrumbs",
  "calendar",
  "copy-url-in-preview",
  "dataview",
  "dataview-interactive-views",
  "editing-toolbar",
  "metadata-menu",
  "note-aliases",
  "obsidian-another-quick-switcher",
  "obsidian-better-command-palette",
  "obsidian-better-internal-link-inserter",
  "obsidian-editor-shortcuts",
  "obsidian-excalidraw-plugin",
  "obsidian-footnotes",
  "obsidian-frontmatter-sync",
  "obsidian-hover-editor",
  "obsidian-linter",
  "obsidian-list-callouts",
  "obsidian-outliner",
  "obsidian-paste-image-rename",
  "obsidian-quiet-outline",
  "obsidian-smarter-md-hotkeys",
  "obsidian-spaced-repetition",
  "obsidian-style-settings",
  "obsidian-tag-replacer",
  "obsidian-tasks-plugin",
  "obsidian-view-mode-by-frontmatter",
  "obsidian-zoom",
  "obsidian-zotero-desktop-connector",
  "periodic-notes",
  "recent-files-obsidian",
  "supercharged-links-obsidian",
  "task-search",
  "templater-obsidian",
  "obsidian-dynamic-highlights",
  "better-search-views",
  "virtual-linker",
  "obsidian-scroll-offset",
  "auto-note-mover",
  "janitor",
  "query-control",
  "obsidian42-brat",
  "frontmatter-markdown-links",
  "tag-replacer",
  "various-complements",
  "obsidian-hotkeys-for-specific-files",
  "quickadd",
  "context-command-hider",
  "obsidian-to-anki-plugin",
  "longform"
]