[
  "dataview",
  "templater-obsidian",
  "quickadd",
  "metadata-menu",
  "calendar",
  "periodic-notes",
  "obsidian-hotkeys-for-specific-files",
  "obsidian-style-settings",
  "supercharged-links-obsidian",
  "auto-note-mover",
  "recent-files-obsidian",
  "obsidian-another-quick-switcher",
  "obsidian-quiet-outline",
  "obsidian-better-command-palette",
  "code-files",
  "obsidian-spaced-repetition"
]