[
  "obsidian-excalidraw-plugin",
  "dataview",
  "templater-obsidian",
  "calendar",
  "obsidian-kanban",
  "obsidian-spaced-repetition",
  "homepage",
  "media-extended",
  "periodic-notes",
  "url-into-selection",
  "obsidian-book-search-plugin",
  "podnotes",
  "quickadd",
  "obsidian-projects",
  "buttons",
  "obsidian-paste-image-rename",
  "highlightr-plugin",
  "supercharged-links-obsidian",
  "obsidian-style-settings"
]